; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p1-2 - location
	p1-5 - location
	p1-7 - location
	p2-0 - location
	p2-5 - location
	p3-0 - location
	p5-4 - location
	p5-6 - location
	p6-2 - location
	p7-3 - location
	p7-4 - location
	p7-5 - location
	p7-6 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s0)
	(at driver4 s2)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at package1 s3)
	(at package2 s6)
	(at package3 s7)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 6)
	(= (time-to-walk p0-1 s0) 6)
	(= (time-to-walk s1 p0-1) 82)
	(= (time-to-walk p0-1 s1) 82)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 2)
	(= (time-to-walk p1-2 s1) 2)
	(= (time-to-walk s2 p1-2) 41)
	(= (time-to-walk p1-2 s2) 41)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 84)
	(= (time-to-walk p1-5 s1) 84)
	(= (time-to-walk s5 p1-5) 90)
	(= (time-to-walk p1-5 s5) 90)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 34)
	(= (time-to-walk p1-7 s1) 34)
	(= (time-to-walk s7 p1-7) 20)
	(= (time-to-walk p1-7 s7) 20)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 62)
	(= (time-to-walk p2-0 s2) 62)
	(= (time-to-walk s0 p2-0) 48)
	(= (time-to-walk p2-0 s0) 48)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 88)
	(= (time-to-walk p2-5 s2) 88)
	(= (time-to-walk s5 p2-5) 96)
	(= (time-to-walk p2-5 s5) 96)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 77)
	(= (time-to-walk p3-0 s3) 77)
	(= (time-to-walk s0 p3-0) 46)
	(= (time-to-walk p3-0 s0) 46)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 24)
	(= (time-to-walk p5-4 s5) 24)
	(= (time-to-walk s4 p5-4) 99)
	(= (time-to-walk p5-4 s4) 99)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 68)
	(= (time-to-walk p5-6 s5) 68)
	(= (time-to-walk s6 p5-6) 17)
	(= (time-to-walk p5-6 s6) 17)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 80)
	(= (time-to-walk p6-2 s6) 80)
	(= (time-to-walk s2 p6-2) 17)
	(= (time-to-walk p6-2 s2) 17)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 80)
	(= (time-to-walk p7-3 s7) 80)
	(= (time-to-walk s3 p7-3) 97)
	(= (time-to-walk p7-3 s3) 97)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(= (time-to-walk s7 p7-4) 56)
	(= (time-to-walk p7-4 s7) 56)
	(= (time-to-walk s4 p7-4) 79)
	(= (time-to-walk p7-4 s4) 79)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 6)
	(= (time-to-walk p7-5 s7) 6)
	(= (time-to-walk s5 p7-5) 37)
	(= (time-to-walk p7-5 s5) 37)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 58)
	(= (time-to-walk p7-6 s7) 58)
	(= (time-to-walk s6 p7-6) 59)
	(= (time-to-walk p7-6 s6) 59)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 32)
	(= (time-to-drive s4 s0) 32)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 72)
	(= (time-to-drive s6 s0) 72)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 66)
	(= (time-to-drive s7 s0) 66)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 38)
	(= (time-to-drive s2 s1) 38)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 53)
	(= (time-to-drive s3 s2) 53)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 68)
	(= (time-to-drive s5 s2) 68)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 79)
	(= (time-to-drive s6 s3) 79)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 36)
	(= (time-to-drive s1 s4) 36)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 57)
	(= (time-to-drive s5 s4) 57)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 12)
	(= (time-to-drive s0 s5) 12)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 56)
	(= (time-to-drive s6 s5) 56)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 19)
	(= (time-to-drive s1 s6) 19)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 60)
	(= (time-to-drive s2 s6) 60)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 44)
	(= (time-to-drive s1 s7) 44)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 14)
	(= (time-to-drive s2 s7) 14)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 36)
	(= (time-to-drive s5 s7) 36)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s7)
	(at driver3 s6)
	(at truck3 s7)
	(at package1 s7)
	(at package2 s6)
	(at package3 s1)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 6
2. (drive-truck truck1 s5 s7 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (driven) from 0 to 36
   goals met: 1 of 6
3. (load-truck package3 truck1 s7)
   deleted: (at package3 s7)
   added: (in package3 truck1)
   goals met: 1 of 6
4. (drive-truck truck1 s7 s1 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   changed: (driven) from 36 to 80
   goals met: 1 of 6
5. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 2 of 6
6. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 2 of 6
7. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 2 of 6
8. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   changed: (walked) from 0 to 48
   goals met: 2 of 6
9. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (driven) from 80 to 124
   goals met: 3 of 6
10. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   changed: (walked) from 48 to 110
   goals met: 3 of 6
11. (walk driver3 s2 p6-2)
   deleted: (at driver3 s2)
   added: (at driver3 p6-2)
   changed: (walked) from 110 to 127
   goals met: 3 of 6
12. (walk driver3 p6-2 s6)
   deleted: (at driver3 p6-2)
   added: (at driver3 s6)
   changed: (walked) from 127 to 207
   goals met: 4 of 6
13. (drive-truck truck3 s7 s2 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (driven) from 124 to 138
   goals met: 3 of 6
14. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 138 to 191
   goals met: 3 of 6
15. (load-truck package1 truck3 s3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   goals met: 3 of 6
16. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 191 to 244
   goals met: 3 of 6
17. (drive-truck truck3 s2 s7 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   changed: (driven) from 244 to 258
   goals met: 4 of 6
18. (disembark-truck driver2 truck3 s7)
   deleted: (driving driver2 truck3)
   added: (at driver2 s7) (empty truck3)
   goals met: 5 of 6
19. (unload-truck package1 truck3 s7)
   deleted: (in package1 truck3)
   added: (at package1 s7)
   goals met: 6 of 6
